/*
 * Copyright (c) 2020-2022 Gustavo Valiente gustavo.valiente@protonmail.com
 * zlib License, see LICENSE file.
 */

#ifndef COMMON_VARIABLE_8x16_SPRITE_FONT_H
#define COMMON_VARIABLE_8x16_SPRITE_FONT_H

#include "bn_sprite_font.h"
#include "bn_utf8_characters_map.h"
#include "bn_sprite_items_common_variable_8x16_font.h"

namespace common
{

constexpr bn::utf8_character variable_8x16_sprite_font_utf8_characters[] = {
    "á", "à", "ả", "ã", "ạ", "â", "ấ", "ầ", "ẩ", "ẫ", "ậ", "ă", "ắ", "ằ", "ẳ", "ẵ", "ặ", "đ", "é", "è", "ẻ", "ẽ", "ẹ", "ê", "ế", "ề", "ể", "ễ", "ệ", "í", "ì", "ỉ", "ĩ", "ị", "ó", "ò", "ỏ", "õ", "ọ", "ô", "ố", "ồ", "ổ", "ỗ", "ộ", "ơ", "ớ", "ờ", "ở", "ỡ", "ợ", "ú", "ù", "ủ", "ũ", "ụ", "ư", "ứ", "ừ", "ử", "ữ", "ự", "ý", "ỳ", "ỷ", "ỹ", "ỵ", "Á", "À", "Ả", "Ã", "Ạ", "Â", "Ấ", "Ầ", "Ẩ", "Ẫ", "Ậ", "Ă", "Ắ", "Ằ", "Ẳ", "Ẵ", "Ặ", "Đ", "É", "È", "Ẻ", "Ẽ", "Ẹ", "Ê", "Ế", "Ề", "Ể", "Ễ", "Ệ", "Í", "Ì", "Ỉ", "Ĩ", "Ị", "Ó", "Ò", "Ỏ", "Õ", "Ọ", "Ô", "Ố", "Ồ", "Ổ", "Ỗ", "Ộ", "Ơ", "Ớ", "Ờ", "Ở", "Ỡ", "Ợ", "Ú", "Ù", "Ủ", "Ũ", "Ụ", "Ư", "Ứ", "Ử", "Ừ", "Ữ", "Ự", "Ý", "Ỳ", "Ỷ", "Ỹ", "Ỵ"
};

constexpr int8_t variable_8x16_sprite_font_character_widths[] = {
    5,  // 32
    2,  // 33 !
    4,  // 34 "
    6,  // 35 #
    6,  // 36 $
    6,  // 37 %
    6,  // 38 &
    2,  // 39 '
    4,  // 40 (
    4,  // 41 )
    6,  // 42 *
    6,  // 43 +
    3,  // 44 
    5,  // 45 -
    3,  // 46 .
    6,  // 47 /
    5,  // 48 0
    4,  // 49 1
    5,  // 50 2
    5,  // 51 3
    6,  // 52 4
    5,  // 53 5
    5,  // 54 6
    5,  // 55 7
    5,  // 56 8
    5,  // 57 9
    3,  // 58 :
    3,  // 59 ;
    6,  // 60 <
    5,  // 61 =
    6,  // 62 >
    6,  // 63 ?
    6,  // 64 @
    6,  // 65 A
    6,  // 66 B
    6,  // 67 C
    6,  // 68 D
    6,  // 69 E
    6,  // 70 F
    6,  // 71 G
    6,  // 72 H
    4,  // 73 I
    5,  // 74 J
    6,  // 75 K
    6,  // 76 L
    6,  // 77 M
    6,  // 78 N
    5,  // 79 O
    6,  // 80 P
    6,  // 81 Q
    6,  // 82 R
    6,  // 83 S
    6,  // 84 T
    6,  // 85 U
    6,  // 86 V
    6,  // 87 W
    6,  // 88 X
    6,  // 89 Y
    6,  // 90 Z
    4,  // 91 [
    6,  // 92
    4,  // 93 ]
    4,  // 94 ^
    7,  // 95 _
    3,  // 96 `
    6,  // 97 a
    6,  // 98 b
    6,  // 99 c
    6,  // 100 d
    6,  // 101 e
    5,  // 102 f
    6,  // 103 g
    6,  // 104 h
    4,  // 105 i
    4,  // 106 j
    6,  // 107 k
    4,  // 108 l
    6,  // 109 m
    6,  // 110 n
    6,  // 111 o
    6,  // 112 p
    6,  // 113 q
    6,  // 114 r
    6,  // 115 s
    5,  // 116 t
    6,  // 117 u
    6,  // 118 v
    6,  // 119 w
    6,  // 120 x
    6,  // 121 y
    6,  // 122 z
    4,  // 123 {
    2,  // 124 |
    4,  // 125 }
    6,  // 126 ~
    6,  // á
    6,  // à
    6,  // ả
    6,  // ã
    6,  // ạ
    6,  // â
    6,  // ấ
    6,  // ầ
    6,  // ẩ
    6,  // ẫ
    6,  // ậ
    6,  // ă
    6,  // ắ
    6,  // ằ
    6,  // ẳ
    6,  // ẵ
	6,  // ặ
	7, // đ
	6, // é
	6, // è
	6, // ẻ
	6, // ẽ
	6, //ẹ
	6, //ê
	6, //ế
	6, //ề
	6, //ể
	6, // ễ
	6,// ệ
	4, //í
	4,//ì
	4,//ỉ
	5,//ĩ
	4,//ị
	6, //ó
	6,//ò
	6,//ỏ
	6,//õ
	6,//ọ
	6,//ô
	6,//ố
	6,//ồ
	6,//ổ
	6,//ỗ
	6,//ộ
	7,//ơ
	7,//ớ
	7,//ờ
	7,//ở
	7,//ỡ
	7,//ợ
	6,//ú
	6,//ù
	6,//ủ
	6,//ũ
	6,//ụ
	7,//ư
	7,//ứ
	7,//ừ
	7,//ử
	7,//ữ
	7,//ự
	6,//ý
	6,//ỳ
	6,//ỷ
	6,//ỹ
	7,//ỵ
	6,//Á
	6,//À
	6,//Ả
	6,//Ã
	6,//Ạ
	6,//Â
	6,//Ấ
	6,//Ầ
	6,//Ẩ
	6,//Ẫ
	6,//Ậ
	6,//Ă
	6,//Ắ
	6,//Ằ
	6,//Ẳ
	6,//Ẵ
	6,//Ặ
	7,//Đ
	6,//É
	6,//È
	6,//Ẻ
	6,//Ẽ
	6,//Ẹ
	6,//Ê
	6,//Ế
	6,//Ề
	6,//Ể
	6,//Ễ
	6,//Ệ
	4,//Í
	4,//Ì
	4,//Ỉ
	5,//Ĩ
	4,//Ị
	5,//Ó
	5,//Ò
	5,//Ỏ
	5,//Õ
	5,//Ọ
	5,//Ô
	5,//Ố
	5,//Ồ
	5,//Ổ
	5,//Ỗ
	5,//Ộ
	6,//Ơ
	6,//Ớ
	6,//Ờ
	6,//Ở
	6,//Ỡ
	6,//Ợ
	6,//Ú
	6,//Ù
	6,//Ủ
	6,//Ũ
	6,//Ụ
	7,//Ư
	7,//Ứ
	7,//Ừ
	7,//Ử
	7,//Ữ
	7,//Ự
	6,//Ý
	6,//Ỳ
	6,//Ỷ
	6,//Ỹ
	6,//Ỵ
};

constexpr bn::span<const bn::utf8_character> variable_8x16_sprite_font_utf8_characters_span(
        variable_8x16_sprite_font_utf8_characters);

constexpr auto variable_8x16_sprite_font_utf8_characters_map =
        bn::utf8_characters_map<variable_8x16_sprite_font_utf8_characters_span>();

constexpr bn::sprite_font variable_8x16_sprite_font(
        bn::sprite_items::common_variable_8x16_font, variable_8x16_sprite_font_utf8_characters_map.reference(),
        variable_8x16_sprite_font_character_widths);

}

#endif
